In [1]:
import pandas as pd

In [2]:
dict1 = {'Name' : ['Luthfi','Adnan','Rahman','Tyo','Abiyyu','Raditya','Naufal' 
                   ],
         'Score' : [90, 89, 80, 99, 87, 83, 99],
         'Gender' : ['Male','Female','Male','Male','Female','Female',
                    'Female']
    
        }
df1=pd.DataFrame(dict1) #Untuk Membuat DataFrame
df1

      Name  Score  Gender
0   Luthfi     90    Male
1    Adnan     89  Female
2   Rahman     80    Male
3      Tyo     99    Male
4   Abiyyu     87  Female
5  Raditya     83  Female
6   Naufal     99  Female

## 1. Menampilkan 3 Kolom Teratas Dari Dataset

In [3]:
df1.head(3) #Secara default fungsi tersebut menampilkan 5 data teratas dari Dataset

     Name  Score  Gender
0  Luthfi     90    Male
1   Adnan     89  Female
2  Rahman     80    Male

## 2.Menampilkan 3 kolom terbawah dari dataset

In [4]:
df1.tail(3)

      Name  Score  Gender
4   Abiyyu     87  Female
5  Raditya     83  Female
6   Naufal     99  Female

## 3. Menampilkan Bentuk dari Dataset (Berisi Jumlah baris dan Kolom)

In [5]:
df1.shape #shape bukan method melaikan Attribute dan menampilkan tuple

(7, 3)

In [6]:
print('Number of Rows', df1.shape[0])
print('Number of Columns', df1.shape[1]) #Menampilkan data melaui tuple ke-1

Number of Rows 7
Number of Columns 3

## 4. Mendapatkan informasi mengenai Dataset seperti total baris, total number, tipedata berdasrkan kolom dan "Memori Requrement"

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Score   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

## 5. Memeriksa nilai kosong/hilang dari dataset

In [8]:
df1.isnull().sum(axis=0)
# Ketika hanya mengetik isnul yang muncul adalah boolean DataTypes
# Ketika ditambahkan fungsi sum yang muncul adalah total dari keseluruhan data kosong
# Ketika axis = 1 akan memunculkan kolom
# Ketika axis = 0 akan memunculkan baris

Name      0
Score     0
Gender    0
dtype: int64

## 6. Mendapatkan semua statistik mengenai DataFrame

In [9]:
df1.describe(include='all')
#Ketika default describe hanya menampilkan kolom numerical
#Ketika ingin mendapatkan semua nilai maka dituliskan include='all'
#Muncul nilai NAN karena kolom tersebut ditujukan untuk kolom numerical

          Name      Score  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Luthfi        NaN  Female
freq         1        NaN       4
mean       NaN  89.571429     NaN
std        NaN   7.299706     NaN
min        NaN  80.000000     NaN
25%        NaN  85.000000     NaN
50%        NaN  89.000000     NaN
75%        NaN  94.500000     NaN
max        NaN  99.000000     NaN

## 7.Menemukan nilai unik dari kolom Jenis Kelamin

In [10]:
df1

      Name  Score  Gender
0   Luthfi     90    Male
1    Adnan     89  Female
2   Rahman     80    Male
3      Tyo     99    Male
4   Abiyyu     87  Female
5  Raditya     83  Female
6   Naufal     99  Female

In [11]:
df1['Gender'].unique()
#Kurung siku digunakan untuk spesifikasi kolom yang dituju

array(['Male', 'Female'], dtype=object)

## 8.Menemukan jumlah nilai unik dari kolom Jenis Kelamin

In [12]:
df1['Gender'].nunique()
#nunique digunakan untuk mendapatkan jumlah dari nilai unik

2

## 9. Menampilkan Jumlah nilai unik dari kolom Jenis Kelamin

In [13]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

## 10. Menemukan siswa yang memiliki nilai diantara 90 sampai 100 menggunakan between Method

In [14]:
df1['Score']>=90
# Ketika memakai fungsi diatas yang muncul adalah jawaban Boleean

0     True
1    False
2    False
3     True
4    False
5    False
6     True
Name: Score, dtype: bool

In [15]:
df1[df1['Score']>=90]
# Ketika memakai fungsi diatas yang muncul adalah kolom dan baris

     Name  Score  Gender
0  Luthfi     90    Male
3     Tyo     99    Male
6  Naufal     99  Female

In [16]:
(df1['Score']>=90) & (df1['Score']<=100)
#Ketika memakai fungsi diatas akan menampilkan jawaban boleaan

0     True
1    False
2    False
3     True
4    False
5    False
6     True
Name: Score, dtype: bool

In [17]:
df1[(df1['Score']>=90) & (df1['Score']<=100)]
#Ketika memakai fungsi diatas akan menampilkan kolom dan baris yang bernilai True

     Name  Score  Gender
0  Luthfi     90    Male
3     Tyo     99    Male
6  Naufal     99  Female

In [18]:
len(df1[(df1['Score']>=90) & (df1['Score']<=100)])
#Fungsi diatas digunakan untuk mengetahui berapa jumlah siswa yang memenuhi kondisi tersebut

3

In [19]:
sum(df1['Score'].between(90,100))
#Fungsi Between digunakan untuk mempersingkat kondisi diatas
#Sum digunakan untuk menjumlahkan seluruh kondisi yang bernilai True

3

## 11. Menemukan nilai rata-rata

In [20]:
df1

      Name  Score  Gender
0   Luthfi     90    Male
1    Adnan     89  Female
2   Rahman     80    Male
3      Tyo     99    Male
4   Abiyyu     87  Female
5  Raditya     83  Female
6   Naufal     99  Female

In [21]:
df1['Score'].mean()
#Menampilkan nilai rata2 dari kolom Score

89.57142857142857

## 12. Metode Apply

In [22]:
def score(x):
    return x//2
#"/" digunakan untuk membagi bilangan
#"//" digutnakan untuk membagi bilangan dan membulatkan bilangan kebawah

In [23]:
df1['Score'].apply(score)
#Menerapkan fungsi apply pada kolom Score

0    45
1    44
2    40
3    49
4    43
5    41
6    49
Name: Score, dtype: int64

In [24]:
df1['Half Score'] = df1['Score'].apply(score)
#Membuat Kolom baru

In [25]:
df1

      Name  Score  Gender  Half Score
0   Luthfi     90    Male          45
1    Adnan     89  Female          44
2   Rahman     80    Male          40
3      Tyo     99    Male          49
4   Abiyyu     87  Female          43
5  Raditya     83  Female          41
6   Naufal     99  Female          49

In [26]:
df1['Score'].apply(lambda x:x/2)
#Cara singkat untuk pengunaan metode lambda

0    45.0
1    44.5
2    40.0
3    49.5
4    43.5
5    41.5
6    49.5
Name: Score, dtype: float64

In [27]:
df1['Name'].apply(len)
#Untuk menampilkan panjang dari masing masing nama

0    6
1    5
2    6
3    3
4    6
5    7
6    6
Name: Name, dtype: int64

## 13. Fungsi Map

In [28]:
df1

      Name  Score  Gender  Half Score
0   Luthfi     90    Male          45
1    Adnan     89  Female          44
2   Rahman     80    Male          40
3      Tyo     99    Male          49
4   Abiyyu     87  Female          43
5  Raditya     83  Female          41
6   Naufal     99  Female          49

In [29]:
df1['Gender'].map({'Male':1, 'Female':0})
#Mengubah kolom gender menjadi boolean

0    1
1    0
2    1
3    1
4    0
5    0
6    0
Name: Gender, dtype: int64

In [30]:
df1['Male_Female']=df1['Gender'].map({'Male':1, 'Female':0})
#Membuat kolom baru yang berisikan boolean male female

In [31]:
df1

      Name  Score  Gender  Half Score  Male_Female
0   Luthfi     90    Male          45            1
1    Adnan     89  Female          44            0
2   Rahman     80    Male          40            1
3      Tyo     99    Male          49            1
4   Abiyyu     87  Female          43            0
5  Raditya     83  Female          41            0
6   Naufal     99  Female          49            0

## 14. Membuang Kolom

In [32]:
df1

      Name  Score  Gender  Half Score  Male_Female
0   Luthfi     90    Male          45            1
1    Adnan     89  Female          44            0
2   Rahman     80    Male          40            1
3      Tyo     99    Male          49            1
4   Abiyyu     87  Female          43            0
5  Raditya     83  Female          41            0
6   Naufal     99  Female          49            0

In [33]:
df1.drop('Male_Female',axis=1)

      Name  Score  Gender  Half Score
0   Luthfi     90    Male          45
1    Adnan     89  Female          44
2   Rahman     80    Male          40
3      Tyo     99    Male          49
4   Abiyyu     87  Female          43
5  Raditya     83  Female          41
6   Naufal     99  Female          49

In [34]:
df1.drop({'Male_Female','Half Score'},axis=1,inplace=True)
#Kurung {} digunakan apabila ingin membuang banyak kolom
#Fungsi inplace digunakan ketika ingin merubah dataframe yang lama

In [35]:
df1

      Name  Score  Gender
0   Luthfi     90    Male
1    Adnan     89  Female
2   Rahman     80    Male
3      Tyo     99    Male
4   Abiyyu     87  Female
5  Raditya     83  Female
6   Naufal     99  Female

## 15. Mencetak nama dari kolom

In [36]:
df1.columns
#Untuk menampilkan nama nama kolom yang tertera pada dataset

Index(['Name', 'Score', 'Gender'], dtype='object')

In [37]:
df1.index
#Untuk menampilkan index dari baris dataset

RangeIndex(start=0, stop=7, step=1)

## 16.Mengurutkan dataset berdasarkan kolom Score

In [38]:
df1

      Name  Score  Gender
0   Luthfi     90    Male
1    Adnan     89  Female
2   Rahman     80    Male
3      Tyo     99    Male
4   Abiyyu     87  Female
5  Raditya     83  Female
6   Naufal     99  Female

In [39]:
df1.sort_values(by='Score',ascending=False)

      Name  Score  Gender
3      Tyo     99    Male
6   Naufal     99  Female
0   Luthfi     90    Male
1    Adnan     89  Female
4   Abiyyu     87  Female
5  Raditya     83  Female
2   Rahman     80    Male

In [40]:
df1.sort_values(by=['Score','Gender'],ascending=False)
#Apabila ascending maka diurutkan dari yang terkecil
#Apabila descending maka diurutkan dari yang terbesar

      Name  Score  Gender
3      Tyo     99    Male
6   Naufal     99  Female
0   Luthfi     90    Male
1    Adnan     89  Female
4   Abiyyu     87  Female
5  Raditya     83  Female
2   Rahman     80    Male

## 17.Menampilkan nama dan nilai dari siswa wanita

In [41]:
df1

      Name  Score  Gender
0   Luthfi     90    Male
1    Adnan     89  Female
2   Rahman     80    Male
3      Tyo     99    Male
4   Abiyyu     87  Female
5  Raditya     83  Female
6   Naufal     99  Female

In [42]:
df1[df1['Gender']=='Female'][['Name','Score']]
#Dataframe digunakan untuk membentuk dataframe baru

      Name  Score
1    Adnan     89
4   Abiyyu     87
5  Raditya     83
6   Naufal     99

In [43]:
df1[df1['Gender'].isin(['Female'])][['Name','Score']]
#Fungsi isin digunakan untuk mencari kolom gender yang berisikan Female

      Name  Score
1    Adnan     89
4   Abiyyu     87
5  Raditya     83
6   Naufal     99